performance-tests/results/login-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /api/auth/login
Document Length:        125 bytes

Concurrency Level:      20
Time taken for tests:   0.039 seconds
Complete requests:      200
Failed requests:        0
Non-2xx responses:      200
Total transferred:      135600 bytes
Total body sent:        39600
HTML transferred:       25000 bytes
Requests per second:    5129.26 [#/sec] (mean)
Time per request:       3.899 [ms] (mean)
Time per request:       0.195 [ms] (mean, across all concurrent requests)
Transfer rate:          3396.13 [Kbytes/sec] received
                        991.79 kb/s sent
                        4387.92 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     1    3   3.0      2      36
Waiting:        1    3   3.0      2      36
Total:          1    4   3.1      3      37

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      6
  95%     10
  98%     10
  99%     11
 100%     37 (longest request)