performance-tests/results/news-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /api/news/category/technology
Document Length:        5122 bytes

Concurrency Level:      50
Time taken for tests:   18.674 seconds
Complete requests:      500
Failed requests:        59
   (Connect: 0, Receive: 0, Length: 59, Exceptions: 0)
Total transferred:      2520592 bytes
HTML transferred:       2278592 bytes
Requests per second:    26.78 [#/sec] (mean)
Time per request:       1867.394 [ms] (mean)
Time per request:       37.348 [ms] (mean, across all concurrent requests)
Transfer rate:          131.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       7
Processing:   315  961 1878.4    374   11950
Waiting:      315  961 1878.4    374   11950
Total:        315  962 1878.5    374   11950

Percentage of the requests served within a certain time (ms)
  50%    374
  66%    435
  75%    509
  80%    558
  90%   2081
  95%   2975
  98%  10254
  99%  11083
 100%  11950 (longest request)